# IFCCategory Template Get Or Create In Session Template Method

Source: https://www.revitapidocs.com/2026/62b8adbe-dcd0-aac0-2d0e-a44e10af0013.htm

---

| IFCCategory Template Get Or Create In Session Template Method |
| --- |

Gets the in\-session non\-serializable template or create new.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IFCCategoryTemplate GetOrCreateInSessionTemplate(
	Document document
)
```

```
Public Shared Function GetOrCreateInSessionTemplate (
	document As Document
) As IFCCategoryTemplate
```

```
public:
static IFCCategoryTemplate^ GetOrCreateInSessionTemplate(
	Document^ document
)
```

```
static member GetOrCreateInSessionTemplate :
        document : Document -> IFCCategoryTemplate
```

#### Parameters

document Document
:   The document to find the in\-session mapping template.

#### Return Value

IFCCategoryTemplate
The mapping template, or if failed to create. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

IFCCategoryTemplate Class Autodesk.Revit.DB Namespace